In [2]:
def warn(*args, **kwargs):
    pass
import warnings
warnings.warn = warn

In [3]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn import tree
from sklearn.ensemble import RandomForestClassifier

In [9]:
income_data = pd.read_csv('income.csv', header = 0, delimiter=', ')
income_data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [12]:
print(income_data.iloc[0])

age                          39
workclass             State-gov
fnlwgt                    77516
education             Bachelors
education-num                13
marital-status    Never-married
occupation         Adm-clerical
relationship      Not-in-family
race                      White
sex                        Male
capital-gain               2174
capital-loss                  0
hours-per-week               40
native-country    United-States
income                    <=50K
Name: 0, dtype: object

In [15]:
labels = income_data[['income']]
labels.head()

  income
0  <=50K
1  <=50K
2  <=50K
3  <=50K
4  <=50K

In [24]:
#  For now, let’s select "age", "capital-gain", "capital-loss", "hours-per-week", and "sex".
# Create a new variable named data that contains only those columns. 

# data = income_data[["age", "capital-gain", "capital-loss", "hours-per-week", "sex"]]
#sex removed because random forest cannot handle strings -> convert to #

data = income_data[["age", "capital-gain", "capital-loss", "hours-per-week"]]

data.head()

   age  capital-gain  capital-loss  hours-per-week
0   39          2174             0              40
1   50             0             0              13
2   38             0             0              40
3   53             0             0              40
4   28             0             0              40

In [27]:
train_data, test_data, train_labels, test_labels = train_test_split(data, labels, random_state=1)

In [28]:
forest = RandomForestClassifier(random_state=1)

In [29]:
forest.fit(train_data, train_labels)

RandomForestClassifier(random_state=1)

In [30]:
print(forest.score(test_data, test_labels))

0.8222577078982926

In [43]:
#data의 sex 항목 변환 및 추가 male =0, female = 1
income_data['sex-int'] = income_data['sex'].apply(lambda x: 0 if x=="Male" else 1)
data = income_data[["age", "capital-gain", "capital-loss", "hours-per-week", "sex-int"]]

data.head()

   age  capital-gain  capital-loss  hours-per-week  sex-int
0   39          2174             0              40        0
1   50             0             0              13        0
2   38             0             0              40        0
3   53             0             0              40        0
4   28             0             0              40        1

In [44]:
train_data, test_data, train_labels, test_labels = train_test_split(data, labels, random_state=1)

In [45]:
forest.fit(train_data, train_labels)

RandomForestClassifier(random_state=1)

In [46]:
print(forest.score(test_data, test_labels))

0.8272939442328953

In [47]:
### transform values in native-country

print(income_data["native-country"].value_counts())

United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: native-country, dtype: int64

In [50]:
income_data["is-American?"]  = income_data["native-country"].apply(lambda x: 0 if x == "United-States" else 1)
# income_data.head()

data = income_data[["age", "capital-gain", "capital-loss", "hours-per-week", "sex-int", "is-American?"]]
data.head()

   age  capital-gain  capital-loss  hours-per-week  sex-int  is-American?
0   39          2174             0              40        0             0
1   50             0             0              13        0             0
2   38             0             0              40        0             0
3   53             0             0              40        0             0
4   28             0             0              40        1             1

In [53]:
train_data, test_data, train_labels, test_labels = train_test_split(data, labels, random_state=1)
forest.fit(train_data, train_labels)
print(forest.score(test_data, test_labels))

0.8225033779633951